package lesson_10_TODO.MyChat;

/**
 * Задание 1.
 * Разработать приложение - многопользовательский чат, в котором участвует произвольное количество клиентов.
 * Каждый клиент после запуска отправляет свое имя серверу.
 * После чего начинает отправлять ему сообщения.
 * Каждое сообщение сервер подписывает именем клиента и рассылает всем клиентам (broadcast).
 *
 * Задание 2.  Усовершенствовать задание 1:
 * добавить возможность отправки личных сообщений (unicast).
 * добавить возможность выхода из чата с помощью написанной в чате команды «quit»
 */
public class Test {
    public static void main(String[] args) {

    }
}
